tiss-webservice/test/solic-status-protocolo/fixtures/sucesso/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ans="http://www.ans.gov.br/padroes/tiss/schemas">
  <soap:Body>
    <ans:tissSolicitacaoStatusProtocolo_Operation>
      <ans:solicitacaoStatusProtocoloWS>
        <ans:cabecalho>
          <ans:identificacaoTransacao>
            <ans:tipoTransacao>SOLIC_STATUS_PROTOCOLO</ans:tipoTransacao>
            <ans:sequencialTransacao>123456789</ans:sequencialTransacao>
            <ans:dataRegistroTransacao>2024-01-15</ans:dataRegistroTransacao>
          </ans:identificacaoTransacao>
          <ans:origem>
            <ans:codigoOperadora>12345</ans:codigoOperadora>
            <ans:codigoRegistro>REG001</ans:codigoRegistro>
          </ans:origem>
          <ans:destino>
            <ans:codigoOperadora>67890</ans:codigoOperadora>
            <ans:codigoRegistro>REG002</ans:codigoRegistro>
          </ans:destino>
          <ans:Padrao>4.00.00</ans:Padrao>
          <ans:loginSenhaPrestador>
            <ans:loginPrestador>user123</ans:loginPrestador>
            <ans:senhaPrestador>pass123</ans:senhaPrestador>
          </ans:loginSenhaPrestador>
        </ans:cabecalho>
        <ans:solicitacaoStatusProtocolo>
          <ans:numeroProtocolo>PROT20240115001</ans:numeroProtocolo>
          <ans:codigoOperadora>67890</ans:codigoOperadora>
        </ans:solicitacaoStatusProtocolo>
        <ans:hash>mock_hash_value_123456789</ans:hash>
      </ans:solicitacaoStatusProtocoloWS>
    </ans:tissSolicitacaoStatusProtocolo_Operation>
  </soap:Body>
</soap:Envelope>
